app/Models/UsuarioModel.php

public function verificarUsuario($usuario, $password)
{
return $this->where('usuario', $usuario)
->where('password', md5($password))
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'andrade'
AND `password` = 'c92a10324374fac681719d63979d00fe'
 LIMIT 1